Revit 2024 API
BuiltInFailures.DimensionFailures Class
 Failures about DimensionFailures.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class DimensionFailures
Visual Basic
Public NotInheritable Class DimensionFailures
Visual C++
public ref class DimensionFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.DimensionFailures
See Also
BuiltInFailures.DimensionFailures Members
Autodesk.Revit.DB Namespace